<template>
    <footer class="mainfooter">
        <div class="container">
            <div class="footer_phone">
                <nav>
                    <ul class="footer_phone_nav_link">
                        <li>
                            <router-link to="/faq">常見問題</router-link>
                        </li>
                        <li>
                            <router-link to="/contact">聯絡我們</router-link>
                        </li>
                        <li @click="toggleServiceModel">
                            <router-link to="">服務條款</router-link>
                        </li>
                        <li @click="togglePrivacyModel">
                            <router-link to="">隱私權政策</router-link>
                        </li>
                    </ul>
                </nav>
                <address>320桃園市中壢區復興路46號9樓</address>
                <address>test123xa2312@gmail.com</address>
                <div class="footer_phone_socialmedia">
                    <a href="tel:+886-3-4251108" class="footer_phone_tel">03-4251108</a>
                    <div class="footer_phone_socialmedia_icon">
                        <a href="#"><i class="fa-brands fa-facebook"></i></a>
                        <a href="#"><i class="fa-brands fa-instagram"></i></a>
                    </div>
                </div>
                <p>本網站為緯育TibaMe_前端設計工程師班第88期第3組學員專題成果作品,本平台僅供學習、展示之用。</p>
                <p>若有抵觸有關著作權,或有第三人主張侵害智慧財產權等情事,均由學員負法律上責任,緯育公司概不負責，若有侵權疑慮，您可以私訊緯育Tibame，後續會由專人協助處理</p>
            </div>
            <div class="footer_pc">
                <nav>
                    <ul class="footer_pc_nav_link">
                        <li>
                            <router-link to="/faq">常見問題</router-link>
                        </li>
                        <li>
                            <router-link to="/contact">聯絡我們</router-link>
                        </li>
                        <li @click="toggleServiceModel">
                            <router-link to="">服務條款</router-link>
                        </li>
                        <li @click="togglePrivacyModel">
                            <router-link to="">隱私權政策</router-link>
                        </li>
                    </ul>
                </nav>
                <div class="footer_pc_info">
                    <address>320桃園市中壢區復興路46號9樓</address>
                    <address>test123xa2312@gmail.com</address>
                    <a href="tel:+886-3-4251108" class="footer_pc_tel">03-4251108</a>
                    <div class="footer_pc_socialmedia_icon">
                        <a href="#"><i class="fa-brands fa-facebook"></i></a>
                        <a href="#"><i class="fa-brands fa-instagram"></i></a>
                    </div>
                </div>
                <p>本網站為緯育TibaMe_前端設計工程師班第88期第3組學員專題成果作品,本平台僅供學習、展示之用。</p>
                <p>若有抵觸有關著作權,或有第三人主張侵害智慧財產權等情事,均由學員負法律上責任,緯育公司概不負責，若有侵權疑慮，您可以私訊緯育Tibame，後續會由專人協助處理</p>
            </div>
            <div class="footer_terms_of_service" v-show="serviceModelStatus">
                <div class="footer_service_bg" @click="toggleServiceModel">
                    <ul class="footer_service_text" @click.stop>
                        <span @click="toggleServiceModel"><i class="fa-solid fa-xmark"></i></span>
                        <li>遵守會員規範<p>在您於健康定胃註冊成為會員後，可以使用健康定胃所提供之各種服務。當您使用健康定胃時，即表示同意接受健康定胃之會員規範及所有注意事項之約束。</p>
                        </li>

                        <li>使用服務
                            <p> 請您於註冊時儘可能提供符合真實之個人資料，您所登錄之資料事後若有變更時，也一併隨時更新。</p>
                        </li>
                        <li>個人資料之蒐集與使用
                            <p>會員於健康定胃提供之個人資料，由緯育股份有限公司及其關係企業（以下簡稱本公司）、及本公司委外服務廠商基於系統營運、客戶服務、帳務管理及其他合於本公司營業項目之特定目的，依個人資料保護法相關規定，對會員之個人資料進行蒐集、處理、利用及／或國際傳輸等事宜，以供
                                健康定胃 營運期間與業務涉及區域範圍內進行聯絡、會員管理、統計調查與分析、系統營運或系統資料庫之執行、使用與處理等用途。
                                除法律另有規定或本公司、健康定胃執行業務所必須者外，會員可隨時透過
                                健康定胃
                                網站，就會員之個人資料向本公司為右列主張或請求：（一）查閱或請求閱覽（二）製給複製本（三）補充或更正（四）停止蒐集、處理或利用（五）刪除。若會員就其個人資料向本公司申請查詢、閱覽個人資料或製給複製本時，本公司將酌收費用。
                                會員得自由選擇是否提供相關個人資料，惟會員所拒絕提供之個人資料，若是本公司或健康定胃辦理業務或作業所需之必要資料，本公司與健康定胃可能無法進行必要的業務或作業而礙難為會員提供相關服務，並有權暫時停止提供對會員之服務。
                            </p>
                        </li>
                        <li>個人資料之保護
                            <p>對於會員所登錄或留存之個人資料，健康定胃在未獲得會員同意以前，決不對外揭露會員之姓名、地址、電子郵件地址及其他依法受保護之個人資料。下述幾種特殊情況不受此限：基於法律之規定。受司法機關或其他有權機關基於法定程序之要求。為保障健康定胃之財產及權益。在緊急情況下為維護其他會員或第三人之人身安全。會員的義務與責任會員對本身於健康定胃或透過健康定胃傳輸的一切內容自負全責:會員承諾遵守中華民國相關法規及一切國際網際網路規定與慣例。會員同意並保證不公布或傳送任何毀謗、不實、威脅、不雅、猥褻、不法、攻擊性、毀謗性或侵害他人智慧財產權的文字，圖片或任何形式的檔案於健康定胃上。非經健康定胃書面同意，會員不得於健康定胃上從事廣告或販賣商品行為。會員同意避免在公眾討論區討論私人事務，發表文章時，請尊重他人的權益及隱私權。會員同意必須充份尊重著作權，禁止發表侵害他人各項智慧財產權之文字、圖片或任何形式的檔案。
                            </p>
                        </li>
                        <li>智慧財產權
                            <p>健康定胃所使用之軟體或程式(以下簡稱軟體)、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計、會員內容等，均由本公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。任何人不得逕自使用、修改、重製、公開播送、公開傳輸、公開演出、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。若會員欲引用或轉載前述軟體、程式或網站內容，除明確為法律所許可者外，必須依法取得本公司或其他權利人的事前書面同意。健康定胃為本公司行銷宣傳本服務之商標，依其註冊或使用之狀態，受商標法及公平交易法等之保護，未經本公司事前書面同意，任何人不得以任何方式使用健康定胃商標。禁止從事違反法律規定之行為健康定胃就會員的行為是否符合會員規範有最終決定權。若健康定胃決定會員的行為違反本會員規範或任何法令，會員同意健康定胃得隨時停止帳號使用權或清除帳號，並停止使用健康定胃。會員在違反法律規定之情事，應自負法律責任。
                            </p>
                        </li>
                        <li>服務之停止與更改
                            <p>於發生下列情形之一時，健康定胃有權停止或中斷提供服務：對健康定胃之設備進行必要之保養及施工時發生突發性之設備故障時由於健康定胃所申請之ISP業者無法提供服務時
                                因天災等不可抗力之因素致使健康定胃無法提供服務時健康定胃可能因公司或ISP業者網路系統軟硬體設備之故障、失靈或人為操作上之疏失而造成全部或部份中斷、暫時無法使用、延遲或造成資料傳輸或儲存上之錯誤、或遭第三人侵入系統篡改或偽造變造資料等，會員不得因此而要求任何補償。
                            </p>
                        </li>
                        <li>保管及通知義務
                            <p>您有責任維持密碼及帳號的機密安全。您必須完全負起因利用該密碼及帳號所進行之一切行動之責任。當密碼或帳號遭到未經授權之使用，或發生其他任何安全問題時，您必須立即通知健康定胃，每次您連線完畢，均要結束您的帳號使用。因您未遵守本項約定所生之任何損失或損害，我們將無法亦不予負責。
                            </p>
                        </li>
                        <li>特別同意事項
                            <p>您同意於健康定胃所發表之一切內容僅代表您個人之立場與行為，並同意承擔所有相關衍生之責任，健康定胃不負任何責任。您同意，健康定胃
                                可以透過您所提供的Email和您取得聯絡，並提供相關課程的資訊給您。</p>
                        </li>
                        <li>擔保責任免除
                            <p>健康定胃保留隨時停止、更改各項服務內容或終止任一會員帳號使用之權利，無需事先通知會員本人。無論任何情形，就停止或更改服務或終止會員帳號使用所可能產生之困擾、不便或損害，健康定胃對任何會員或第三人均不負任何責任。健康定胃保留將來新增、修改或刪除各項服務之全部或一部之權利，且不另行個別通知會員不得因此而要求任何補償或賠償。健康定胃提供之特定服務可能存在專屬之服務條款，在此情形下，雙方權利義務將依據該服務之專屬條款決定之。
                            </p>
                        </li>
                        <li>損害賠償
                            <p>因會員違反相關法令或違背本同意書之任一條款，致健康定胃或其關係企業、受僱人、受託人、代理人及其他相關履行輔助人因而受有損害或支出費用（包括且不限於因進行民事、刑事及行政程序所支出之律師費用）時，會員應負擔損害賠償責任或填補其費用。
                            </p>
                        </li>
                        <li>會員規範之修改
                            <p>健康定胃保留隨時修改本會員規範之權利，健康定胃將於修改會員規範時，於WEB首頁公告修改之內容，而不另對會員作個別通知。若會員不同意修改的內容，請勿繼續使用綠人學院。如果會員繼續使用綠人學院，將視為會員已同意並接受本規範等增訂或修改內容之約束。
                            </p>
                        </li>
                        <li>個別條款之效力
                            <p>本同意書所定之任何會員條款之全部或一部無效時，不影響其他條款之效力。</p>
                        </li>
                        <li>準據法及管轄法院
                            <p>本同意書之解釋及適用以及會員因使用本服務而與綠人學院間所生之權利義務關係，應依中華民國法令解釋適用之。其因此所生之爭議，以臺灣臺北地方法院為第一審管轄法院。</p>
                        </li>
                    </ul>
                </div>
            </div>
            <div class="footer_privacy_policy" v-show="privicyModelStatus">
                <div class="footer_privacy_bg" @click="togglePrivacyModel">
                    <ul class="footer_privacy_text" @click.stop>
                        <span @click="togglePrivacyModel"><i class="fa-solid fa-xmark"></i></span>
                        <li>適用範圍
                            <p>健康定胃「隱私權聲明」適用於您與健康定胃洽辦業務、參與各項活動（如報名研討會/課程、加入網站會員、訂閱電子報等）或透過電話、傳真或健康定胃網站意見信箱提出詢問或建議時（包括健康定胃官網及健康定胃各業務部門網站），所涉及之個人資料蒐集、處理與利用行為。凡經由健康定胃網站連結至第三方獨立管理、經營之網站，有關個人資料的保護，適用第三方或各該網站的隱私權政策，健康定胃不負任何連帶責任。
                            </p>
                        </li>
                        <li>蒐集之個人資料類別
                            <p>辨識個人者(如姓名、相片、職稱、電話號碼、電子信箱、居住或工作地址、及其他任何可辨識資料本人者等)、辨識財務者(如金融機構帳戶、信用卡之號碼與姓名、個人之其他帳戶等)、政府資料中之辨識者(如身分證統一編號、統一編號、證照號碼等)、個人描述、職業專長、現行之受僱情形、財務交易。
                            </p>
                        </li>
                        <li>個人資料之蒐集、處理及利用<p>
                                當您與健康定胃洽辦業務或參與健康定胃各項活動，我們將視業務或活動性質請您提供必要的個人資料，並在該特定目的範圍內處理及利用您的個人資料；非經您書面同意，健康定胃不會將個人資料用於其他用途。
                                如果您使用電話、傳真或健康定胃網站意見信箱與健康定胃聯繫時，請您提供正確的電話、傳真號碼或電子信箱地址，作為回覆來詢事項之用。
                                您的個人資料在處理過程中，健康定胃將遵守相關之流程及內部作業規範，並依據資訊安全之要求，進行必要之人員控管。
                                單純瀏覽健康定胃網站及下載檔案之行為，健康定胃不會蒐集任何與個人身份有關之資訊。 您同意健康定胃網站，透過您所提供的郵件地址，與您取得聯絡並發送課程相關資訊提供您參考。
                            </p>
                        </li>
                        <li>與第三人共用個人資料<p>
                                健康定胃絕不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。 前項但書之情形包括不限於： 配合司法單位合法的調查。
                                配合主管機關依職權或職務需要之調查或使用（例如審計部或會計師查帳）。 基於善意相信揭露您的個人資料為法律所必需。
                                當您在健康定胃網站的行為，違反健康定胃的服務條款或可能損害或妨礙健康定胃權益或導致任何人遭受損害時，經健康定胃研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。
                                基於委外契約關係，健康定胃依約履行提供個人資料之義務。 健康定胃委託廠商協助蒐集、處理或利用您的個人資料時，將對委外廠商或個人善盡監督管理之責。
                            </p>
                        </li>
                        <li>cookie之運用<p>
                                基於網站內部管理之需要及提供最佳個人化服務，健康定胃網站將在您的瀏覽器中寫入cookies並讀取記錄瀏覽者的IP位址、上網時間以及在各項資訊查閱之次數，進行網站流量和網路行為調查之總量分析，並適時地對個別瀏覽者進行分析，以提供更符合的資訊服務。
                                若您關閉cookies，將無法使用本站與網站群部分服務。
                            </p>
                        </li>
                        <li>伺服器紀錄<p>
                                當您透過瀏覽器、應用程式或其他用戶端使用健康定胃網站時，我們的伺服器會自動記錄特定的技術性資訊。這些伺服器紀錄可能包含您的網頁要求、網際網路通訊協定位址、瀏覽器類型、瀏覽器語言、送出要求的日期和時間等資訊。此伺服器紀錄僅作為伺服器管理的參考，健康定胃不會利用此伺服器紀錄對「個別」瀏覽者進行分析。
                            </p>
                        </li>
                        <li>隱私權聲明之修改<p>
                                本隱私權聲明將適時依據法律修正、相關技術之發展及內部管理制度之調整而配合修改，以落實保障您隱私權及網路安全之初衷，請會員隨時上網察看。
                            </p>
                        </li>
                        <li>帳號資料之刪除<p>
                                如果您需要刪除您的帳號或任何保存於健康定胃的相關資訊， 請您透過Service@anthro_academy.com聯絡我們，我們將提供給您相關資訊刪除服務之協助。
                                您可以參閱此頁面有更多說明 (https://www.anthro_academy.com/eventpage/accounts)
                            </p>
                        </li>
                    </ul>
                </div>
            </div>
        </div>
    </footer>
</template>
<script>
import { RouterLink } from 'vue-router'
export default {
    data() {
        return {
            targetValue: 0,
            serviceModelStatus: false,
            privicyModelStatus: false,
        }
    },
    created() { },
    methods: {
        toggleServiceModel() {
            this.serviceModelStatus = !this.serviceModelStatus
        },
        togglePrivacyModel() {
            this.privicyModelStatus = !this.privicyModelStatus
        }
    },
    components: {
        RouterLink,
    },
}
</script>

<style lang="scss">
@import "@/assets/scss/layout/_footer.scss";
</style>